{
  "Project dates inconsistencies": "Anghysondebau dyddiadau'r prosiect",
  "Update all stored dates": "Diweddaru pob dyddiad a storir",
  "Found {} inconsistent dates, across {projects} projects.": "Canfuwyd {} o ddyddiadau anghyson, ar draws prosiectau {projects}.",
  "Project": "Prosiect",
  "Date": "Dyddiad",
  "Field": "Maes",
  "Stored": "Storiwyd",
  "Calculated": "Cyfrifwyd",
  "Difference": "Gwahaniaeth",
  "Force dates recalculation": "Gorfodi ail-gyfrifiad o'r dyddiadau",
  "View history": "Gweld hanes",
  "Date completed": "Dyddiad y cwblhawyd",
  "Deadline": "Amser terfyn",
  "Reminder sent": "Anfonwyd nodyn atgoffa",
  "Add previous": "Ychwanegu'r blaenorol",
  "Edit": "Golygu",
  "Set": "Gosod",
  "Show earliest submission dates...": "Dangos dyddiadau cyflwyno cynharaf...",
  "Hide earliest submission dates...": "Cuddio dyddiadau cyflwyno cynharaf...",
  "Edit {} for {projectTitle}": "Golygu {} ar gyfer {projectTitle}",
  "The system already has a date recorded for this event. Setting a new date with this form will override the recorded date, indicating that the action did not occur at that time.": "Mae gan y system ddyddiad wedi ei recordio ar gyfer y digwyddiad hwn eisoes. Bydd gosod dyddiad newydd â'r ffurf hon yn diystyru'r dyddiad a gofnodwyd, gan ddynodi na ddigwyddodd y weithred ar yr adeg honno.",
  "The system already has a date recorded for this event. Setting a new date with this form will override the recorded date, indicating that the action did not occur at that time. The system will delete all the previous dates if you indicate that the action should occur at a future time.": "Mae gan y system ddyddiad wedi ei gofnodi am y digwyddiad hwn eisoes. Bydd gosod dyddiad newydd yn y ffurf hon yn diystyru'r dyddiad a gofnodwyd, gan ddynodi na ddigwyddodd y weithred ar yr adeg honno. Bydd y system yn dileu pob dyddiad blaenorol os ydych yn nodi dylai'r weithred ddigwydd yn y dyfodol.",
  "Enter the dates from latest to oldest. Don't miss dates from your list as you won't be able to insert them in the list in the system later.": "Nodwch y dyddiadau o'r diweddaraf i'r hynaf. Peidiwch â hepgor dyddiadau o'ch rhestr gan na fyddwch yn gallu eu rhoi nhw i mewn yn y system yn ddiweddarach.",
  "Please complete all required fields.": "Cwblhewch bob maes gofynnol.",
  "Set date": "Gosod y dyddiad",
  "Add previous date": "Ychwanegu ddyddiad blaenorol",
  "Delete": "Dileu",
  "Delete date and previous dates": "Dileu'r dyddiad a dyddiadau blaenorol",
  "Dates history": "Hanes dyddiadau",
  "Version:": "Fersiwn:",
  "Action:": "Cam:",
  "Created:": "Crëwyd:",
  "No versions found.": "Ni chanfuwyd unrhyw fersiynau.",
  "Previous": "Blaenorol",
  "Next": "Nesaf",
  "Imported {kind}: {}": "Mewngludwyd {kind}: {}",
  "Fix nulls imported into project journal data?": "Gosod y nyliau a allgudwyd i mewn i ddata dyddiadur y prosiect?",
  "Fixed {count} journals": "{count} o gylchgronau sefydlog",
  "Fix": "Gosod",
  "Recalculate dates for:": "Ail-gyfrif dyddiadau ar gyfer:",
  "Recalculate project dates for this project. This should only be required in exceptional circumstances.": "Ail-gyfrif dyddiadau prosiect ar gyfer y prosiect hwn. Dylid ond bod angen hyn mmewn amgylchiadau eithriadol.",
  "Deleting the state for the dates will reset any errors that have been persisted in 'periodEndRules'. Use with caution.": "Bydd dileu cyflwr ar gyfer y dyddiadau yn ail-osod unrhyw wallau sydd wedi parhau yn y 'cyfnodRheolauDiwedd'. Defnyddiwch yn ofalus.",
  "Confirm": "Cadarnhau",
  "Confirm and delete previous state": "Cadarnhau a dileu y cyflwr blaenorol",
  "Recalculate all project dates in this application. \\n This should only be used if you understand the causes behind all {count} entries in the 'inconsistencies' table, and agree with the corrected calculated dates": "Ailgyfrifo holl ddyddiau'r prosiect yn y cais hwn. \\n Dylai hwn ond ei ddefnyddio os ydych yn deal yr achosion tu ôl i bob {count} cofnod yn y tabl 'anghysondebau' ac rydych yn cytuno â'r dyddiadau a gyfrifwyd a gywirwyd",
  "Recalculate all dates": "Ail-gyfrif pob dyddiad",
  "You will delete all saved state associated with the project dates in the system.": "Byddwch yn dileu'r holl gyflwr a gadwyd sy'n gysylltiedig â dyddiadau'r prosiect yn y system.",
  "More information...": "Rhagor o wybodaeth..."
}