{
  "Please click {} to change to a valid email address and try again.": "Cliciwch {} i newid i gyfeiriad e-bost dilys a rhowch gynnig arall arni.",
  "The information below is missing:": "Mae'r wybodaeth isod ar goll:",
  "First name": "Enw cyntaf",
  "Last name": "Enw olaf",
  "Email": "E-bost",
  "Please add the missing information to the {} record.": "Ychwanegwch yr wybodaeth sydd ar goll i'r cofnod {}.",
  "Welcome to {}. Your external account has been created, and to get started you need to set your password.": "Croeso i {}. Mae'ch cyfrif allanol wedi ei greu, ac i roi cychwyn arni, mae angen ichi osod eich cyfrinair.",
  "Click here to set password.": "Cliciwch yma i osod y cyfrinair.",
  "This link will work only once. Once you've set your password, you can discard this email.": "Bydd y ddolen hon ond yn gweithio unwaith. Unwaith rydych wedi gosod eich cyfrinair, gallwch gael gwared â'r e-bost hwn.",
  "Please use the alternative external user login link on the home page.": "Defnyddiwch y ddolen fewngofnodi defnyddiwr allanol amgen ar yr hafan.",
  "Your previous user account has been reactivated. Click below to login.": "Mae'ch cyfrif defnyddiwr blaenorol wedi ei hail-actifadu. Cliciwch isod i fewngofnodi.",
  "Log in": "Mewngofnodi",
  "Name": "Enw",
  "External access account": "Cyfrif mynediad allanol",
  "Revoke access": "Diddymu mynediad",
  "Link sent": "Anfonwyd y ddolen",
  "Account activated": "Actifadwyd y cyfrif",
  "Revoke": "Diddymu",
  "The following details will be used to create the user account:": "Defnyddir y manylion canlynol i greu cyfrif y defnyddiwr:",
  "First name:": "Enw cyntaf:",
  "Last name:": "Enw olaf:",
  "Email:": "E-bost:",
  "Edit record": "Golygu'r cofnod",
  "Confirm": "Cadarnhau",
  "Missing data": "Data ar goll",
  "Request external access": "Cais am fynediad allanol",
  "Confirm external access for the NAME(External Researcher)": "Cadarnhau mynediad allanol ar gyfer y NAME(External Researcher)",
  "Invalid Email Address": "Cyfeiriad E-bost Annilys",
  "Reactivate user": "Ail-actifadu'r defnyddiwr",
  "The NAME(External Researcher) has a previously existing user account. Confirm to reactivate it.": "Mae gan NAME(External Researcher) gyfrif defnyddiwr sydd eisoes yn bodoli yn flaenorol. Cadarnhewch er mwyn ei ail-actifadu.",
  "Confirm revocation of {title}'s external access": "Cadarnhau diddymiad mynediad allanol {title}",
  "Resend password setting email": "Ail-anfon yr e-bost gosod y cyfrinair",
  "Email {title} instructions for getting started on {application}": "E-bostio cyfarwyddiadau {title} ar gyfer dechrau ar {application}",
  "Email address already in use": "Cyfeiriad e-bost eisoes yn cael ei ddefnyddio",
  "The email address is already in use by another user. The record will be updated however the user account for {researcher} will not be updated with this email address": "Mae'r cyfeiriad e-bost eisoes yn cael ei ddefnyddio gan ddefnyddiwr arall. Bydd y cofnod yn cael ei diweddaru fodd bynnag ni fydd cyfrif y defnyddiwr ar gyfer {researcher} yn cael ei ddiweddaru â'r cyfeiriad e-bost hwn.",
  "OK": "Iawn"
}